spec/support/mvi/find_candidate_response.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
              xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Header/>
  <env:Body>
    <idm:PRPA_IN201306UV02 xmlns="urn:hl7-org:v3" xmlns:idm="http://vaww.oed.oit.va.gov" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                           ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd">
      <id extension="WSDOC1609131753362231779394902" root="2.16.840.1.113883.4.349"/>
      <creationTime value="20160913175336"/>
      <versionCode code="3.0"/>
      <interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/>
      <processingCode code="T"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="NE"/>
      <receiver typeCode="RCV">
        <device determinerCode="INSTANCE" classCode="DEV">
          <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
        </device>
      </receiver>
      <sender typeCode="SND">
        <device determinerCode="INSTANCE" classCode="DEV">
          <id extension="200M" root="2.16.840.1.113883.4.349"/>
        </device>
      </sender>
      <acknowledgement>
        <typeCode code="AA"/>
        <targetMessage>
          <id extension="MCID-12345" root="1.2.840.114350.1.13.0.1.7.1.1"/>
        </targetMessage>
        <acknowledgementDetail>
          <code codeSystemName="MVI" code="132" displayName="IMT"/>
          <text>Identity Match Threshold</text>
        </acknowledgementDetail>
        <acknowledgementDetail>
          <code codeSystemName="MVI" code="120" displayName="PDT"/>
          <text>Potential Duplicate Threshold</text>
        </acknowledgementDetail>
      </acknowledgement>
      <controlActProcess classCode="CACT" moodCode="EVN">
        <code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/>
        <subject typeCode="SUBJ">
          <registrationEvent classCode="REG" moodCode="EVN">
            <id nullFlavor="NA"/>
            <statusCode code="active"/>
            <subject1 typeCode="SBJ">
              <patient classCode="PAT">
                <id extension="1000123456V123456^NI^200M^USVHA^P" root="2.16.840.1.113883.4.349"/>
                <id extension="12345^PI^516^USVHA^PCE" root="2.16.840.1.113883.4.349"/>
                <id extension="2^PI^553^USVHA^PCE" root="2.16.840.1.113883.4.349"/>
                <id extension="12345^PI^200HD^USVHA^A" root="2.16.840.1.113883.4.349"/>
                <id extension="TKIP123456^PI^200IP^USVHA^A" root="2.16.840.1.113883.4.349"/>
                <id extension="123456^PI^200MHV^USVHA^A" root="2.16.840.1.113883.4.349"/>
                <id extension="1234^NI^200DOD^USDOD^A" root="2.16.840.1.113883.3.42.10001.100001.12" />
                <id extension="12345678^PI^200CORP^USVBA^A" root="2.16.840.1.113883.4.349"/>
                <id extension="123456789^PI^200VETS^USDVA^A" root="2.16.840.1.113883.4.349" />
                <statusCode code="active"/>
                <patientPerson>
                  <name use="L">
                    <given>JOHN</given>
                    <given>WILLIAM</given>
                    <family>SMITH</family>
                    <prefix>MR</prefix>
                    <suffix>SR</suffix>
                  </name>
                  <name use="P">
                    <delimiter>101</delimiter>
                    <family>SMITH</family>
                  </name>
                  <name use="C">
                    <family>SMITH</family>
                  </name>
                  <telecom value="1112223333" use="HP"/>
                  <administrativeGenderCode code="M"/>
                  <birthTime value="19800101"/>
                  <addr use="PHYS">
                    <streetAddressLine>121 A St</streetAddressLine>
                    <city>Austin</city>
                    <state>TX</state>
                    <postalCode>78772</postalCode>
                    <country>USA</country>
                  </addr>
                  <multipleBirthInd value="true"/>
                  <asOtherIDs classCode="SSN">
                    <id extension="555443333" root="2.16.840.1.113883.4.1"/>
                    <scopingOrganization determinerCode="INSTANCE" classCode="ORG">
                      <id root="1.2.840.114350.1.13.99997.2.3412"/>
                    </scopingOrganization>
                  </asOtherIDs>
                  <birthPlace>
                    <addr>
                      <city>JOHNSON CITY</city>
                      <state>MS</state>
                      <country>USA</country>
                    </addr>
                  </birthPlace>
                </patientPerson>
                <subjectOf1>
                  <queryMatchObservation classCode="COND" moodCode="EVN">
                    <code code="IHE_PDQ"/>
                    <value value="162" xsi:type="INT"/>
                  </queryMatchObservation>
                </subjectOf1>
              </patient>
            </subject1>
            <custodian typeCode="CST">
              <assignedEntity classCode="ASSIGNED">
                <id root="2.16.840.1.113883.4.349"/>
              </assignedEntity>
            </custodian>
          </registrationEvent>
        </subject>
        <queryAck>
          <queryId extension="18204" root="2.16.840.1.113883.3.933"/>
          <queryResponseCode code="OK"/>
          <resultCurrentQuantity value="1"/>
        </queryAck>
        <queryByParameter>
          <queryId extension="18204" root="2.16.840.1.113883.3.933"/>
          <statusCode code="new"/>
          <modifyCode code="MVI.COMP1"/>
          <initialQuantity value="1"/>
          <parameterList>
            <livingSubjectName>
              <value use="L">
                <given>John</given>
                <given>William</given>
                <family>Smith</family>
              </value>
              <semanticsText>LivingSubject.name</semanticsText>
            </livingSubjectName>
            <livingSubjectBirthTime>
              <value value="19800101"/>
              <semanticsText>LivingSubject..birthTime</semanticsText>
            </livingSubjectBirthTime>
            <livingSubjectId>
              <value extension="555-44-3333" root="2.16.840.1.113883.4.1"/>
              <semanticsText>SSN</semanticsText>
            </livingSubjectId>
          </parameterList>
        </queryByParameter>
      </controlActProcess>
    </idm:PRPA_IN201306UV02>
  </env:Body>
</env:Envelope>
